In [1]:
import pandas as pd

In [27]:
# first method for creating a dataframe
df=pd.DataFrame({
    "a":[1,2],
    "b":[5,6],
    "c":[10,11]
},index=[1,2])
# first method for creating a dataframe
df1=pd.DataFrame({
    "a":[1,2],
    "b":[5,6],
    "c":[10,11]
},index=[1,2])
print(df1,df)

   a  b   c
1  1  5  10
2  2  6  11    a  b   c
1  1  5  10
2  2  6  11

In [10]:
# gather columns into raw
df2=pd.melt(df)
df2

  variable  value
0        a      1
1        a      2
2        b      5
3        b      6
4        c     10
5        c     11

In [26]:
pd.concat([df1,df])

   a  b   c
1  1  5  10
2  2  6  11
1  1  5  10
2  2  6  11

In [30]:
# append column
df3=pd.DataFrame({
    "a":[4,5],
    "b":[9,9],
    "k":[11,12]
})
pd.concat([df1,df3],axis=0)

   a  b     c     k
1  1  5  10.0   NaN
2  2  6  11.0   NaN
0  4  9   NaN  11.0
1  5  9   NaN  12.0